app/controllers/application_controller.rb

SELECT `account`.* FROM `account` WHERE `account`.`username` = 'azr1' AND `account`.`auth_id` = '20S0KPNOIM' ORDER BY `account`.`id` ASC LIMIT 1
---
   def authenticate_request
     Account.reset_current
     begin
       header_value = request.headers['Authorization']
       creds = ::Base64.decode64(request.authorization.split(' ', 2).last || '')
       uname, pwd = creds.split(':')
       account = Account.where(username: uname, auth_id: pwd).first